/*-------------------------------------------------------------------------*
 * File:  SSP.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1788 SSP Bus Interface.
 * Implementation:
 *      Two SSPs are created, SSP0 and SSP1 and SSP2.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include "Config.h"
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <uEZPlatform.h>
#include <HAL/GPIO.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC1788/LPC1788_SSP.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 iCR0; // 0x00
#define SSP_FRF_SPI (0<<4)      // Frame format: SPI
#define SSP_FRF_TI  (1<<4)      // Frame format: TI
#define SSP_FRF_MW  (2<<4)      // Frame format: Microwire
#define SSP_CPOL    (1<<6)      // Clock Polarity
#define SSP_CPHA    (1<<7)      // Clock Phase
    TVUInt32 iCR1; // 0x04
#define SSP_LBM     (1<<0)      // Loop back mode
#define SSP_SSE     (1<<1)      // SSP Enable
#define SSP_MS      (1<<2)      // Master/Slave Mode (master=0)
#define SSP_SOD     (1<<3)      // Slave Output Disable
    TVUInt32 iDR; // 0x08
    TVUInt32 iSR; // 0x0C -- read only
#define SSP_TFE     (1<<0)      // Transmit FIFO Empty
#define SSP_TNF     (1<<1)      // Transmit FIFO Not Full
#define SSP_RNE     (1<<2)      // Receive FIFO Not Empty
#define SSP_RFF     (1<<3)      // Receive FIFO Full
#define SSP_BSY     (1<<4)      // Busy
    TVUInt32 iCPSR; // 0x10
    TVUInt32 iIMSC; // 0x14
#define SSP_RORIM   (1<<0)      // Receive overrun interrupt
#define SSP_RTIM    (1<<1)      // Receive timeout
#define SSP_RXIM    (1<<2)      // Rx FIFO is at least half full
#define SSP_TXIM    (1<<3)      // Tx FIFO is at least half empty
    TVUInt32 iRIS; // 0x18
#define SSP_RORRIS  (1<<0)      // Raw Receive overrun interrupt
#define SSP_RTRIS   (1<<1)      // Raw Receive timeout
#define SSP_RXRIS   (1<<2)      // Raw Rx FIFO is at least half full
#define SSP_TXRIS   (1<<3)      // Raw Tx FIFO is at least half empty
    TVUInt32 iMIS; // 0x1C
#define SSP_RORMIS  (1<<0)      // Mask (1=on) Receive overrun interrupt
#define SSP_RTMIS   (1<<1)      // Mask (1=on) Receive timeout
#define SSP_RXMIS   (1<<2)      // Mask (1=on) Rx FIFO is at least half full
#define SSP_TXMIS   (1<<3)      // Mask (1=on) Tx FIFO is at least half empty
    TVUInt32 iICR; // 0x20
#define SSP_RORIC   (1<<0)      // Clears SSP_RORIM interrupt
#define SSP_RTIC    (1<<1)      // Clears SSP_RTRIS interrupt
    TVUInt32 iDMACR;// 0x24
#define SSP_RXDMAE  (1<<0)      // When 1, DMA enabled for Rx FIFO
#define SSP_TXDMAE  (1<<1)      // When 1, DMA enabled for Tx FIFO
} T_LPC1788_SSP_Registers;

typedef struct {
    const HAL_SPI *iHAL;
    T_LPC1788_SSP_Registers *iReg;
    T_spiCompleteCallback iCompleteCallback;
    void *iCompleteCallbackWorkspace;
    SPI_Request *iRequest;
    T_irqChannel iIRQChannel;
    TBool iIsBusy;
} T_LPC1788_SSP_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISSP0IRQ );
IRQ_ROUTINE( ISSP1IRQ );
IRQ_ROUTINE( ISSP2IRQ );
static void ISSPEnd(SPI_Request *aRequest);
static void ISSPProcessInterrupt(T_LPC1788_SSP_Workspace *aW);
static void ISSPOutput(T_LPC1788_SSP_Workspace *aW);

/*---------------------------------------------------------------------------*
 * Globals:
