/*-------------------------------------------------------------------------*
 * File:  LPC1756_Timer.c
 *-------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
 /**
 *    @addtogroup LPC1756_Timer
 *  @{
 *  @brief     uEZ LPC1756 Timer Interface
 *  @see http://www.teamfdi.com/uez/
 *  @see http://www.teamfdi.com/uez/files/uEZLicense.txt
 *
 *    HAL implementation of the LPC1756 Timers Interface.
 * Implementation:
 *      Two Timers are created, Timer0 and Timer1.
 *
 * @par Example code:
 * Example task to 
 * @par
 * @code
 * #include <uEZ.h>
 * TODO
 * @endcode
 */
#include <Config.h>
#include <uEZTypes.h>
#include <uEZErrors.h>
#include <uEZProcessor.h>
#include <HAL/GPIO.h>
#include <HAL/Timer.h>
#include <uEZBSP.h>
#include <HAL/Interrupt.h>
#include <uEZPlatformAPI.h>
#include <Source/Processor/NXP/LPC1756/LPC1756_Timer.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
//typedef TIM_TypeDef T_LPC1756_Timer_Registers;

typedef struct {
    TUInt16 iVector;
    TISRFPtr iISR;
    const char *iName;
    TUInt8 iPCONBitIndex;
} T_LPC1756_Timer_Info;

typedef struct {
    T_HALTimer_Callback iCallbackFunc;
    void *iCallbackWorkspace;
} T_LPC1756_Timer_InterruptCallback;

/*
typedef struct {
    const HAL_Timer *iHAL;
    T_LPC1756_Timer_Registers *iReg;
    TUInt32 iPeriod;
} T_LPC1756_Timer_Workspace;
*/

typedef struct {
    TVUInt32 iIR; // 0x00
    TVUInt32 iTCR; // 0x04
    TVUInt32 iTC; // 0x08
    TVUInt32 iPR; // 0x0C
    TVUInt32 iPC; // 0x10
    TVUInt32 iMCR; // 0x14
    TVUInt32 iMR[4]; // 0x18, 0x1C, 0x20, 0x24
    TVUInt32 iCCR; // 0x28
    TVUInt32 iCR[4]; // 0x2C, 0x30, 0x34, 0x38
    TVUInt32 iEMR; // 0x3C
    TVUInt32 ireserved1[4]; // 0x40, 0x44, 0x48, 0x4C
    TVUInt32 ireserved2[4]; // 0x50, 0x54, 0x58, 0x5C
    TVUInt32 ireserved3[4]; // 0x60, 0x64, 0x68, 0x6C
    TVUInt32 iCTCR; // 0x70
} T_LPC1756_Timer_Registers;

typedef struct {
    const HAL_Timer *iHAL;
    T_LPC1756_Timer_Registers *iReg;
    T_LPC1756_Timer_InterruptCallback iCallbacks[4]; // one per match register
    const T_LPC1756_Timer_Info *iInfo;
} T_LPC1756_Timer_Workspace;



/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static const T_LPC1756_Timer_Info G_Timer0_Info;
static const T_LPC1756_Timer_Info G_Timer1_Info;
static const T_LPC1756_Timer_Info G_Timer2_Info;
static const T_LPC1756_Timer_Info G_Timer3_Info;
T_LPC1756_Timer_Workspace *G_Timer0_Workspace;
T_LPC1756_Timer_Workspace *G_Timer1_Workspace;
T_LPC1756_Timer_Workspace *G_Timer2_Workspace;
T_LPC1756_Timer_Workspace *G_Timer3_Workspace;
static void ITimerProcessIRQ(T_LPC1756_Timer_Workspace *p);


/*---------------------------------------------------------------------------*
